#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```hcl
terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/stae1102-org/terraform-aws-tfc-workflow/runs/run-X3pVQyi6LQHBuz68

Waiting for the plan to start...

Terraform v1.6.5
on linux_amd64
Initializing plugins and modules...
[0m[1mtls_private_key.hashicat: Refreshing state... [id=850444e5fe67afaa9a6f2c3b44fb729c3fee88a3][0m
[0m[1maws_key_pair.hashicat: Refreshing state... [id=stae1102-ssh-key.pem][0m
[0m[1mdata.aws_ami.ubuntu: Reading...[0m[0m
[0m[1maws_vpc.hashicat: Refreshing state... [id=vpc-08957f3a49972148c][0m
[0m[1mdata.aws_ami.ubuntu: Read complete after 1s [id=ami-07ba757d6e39916a6][0m
[0m[1maws_internet_gateway.hashicat: Refreshing state... [id=igw-0696bd5b35b9b7839][0m
[0m[1maws_subnet.hashicat: Refreshing state... [id=subnet-0c9c479fc2ba47a98][0m
[0m[1maws_security_group.hashicat: Refreshing state... [id=sg-0afc3a656042a8dff][0m
[0m[1maws_route_table.hashicat: Refreshing state... [id=rtb-03a16de043f1f89a1][0m
[0m[1maws_instance.hashicat: Refreshing state... [id=i-001dfccad00403f48][0m
[0m[1maws_route_table_association.hashicat: Refreshing state... [id=rtbassoc-0b66c4cec8eabff4b][0m
[0m[1maws_eip.hashicat: Refreshing state... [id=eipalloc-0799042df998ccfae][0m
[0m[1maws_eip_association.hashicat: Refreshing state... [id=eipassoc-09697441d3ca18792][0m
[0m[1mnull_resource.configure_cat_app: Refreshing state... [id=2156670416893226995][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [33m~[0m update in-place[0m
[31m-[0m/[32m+[0m destroy and then create replacement[0m

Terraform will perform the following actions:

[1m  # aws_eip.hashicat[0m will be updated in-place
[0m  [33m~[0m[0m resource "aws_eip" "hashicat" {
        id                   = "eipalloc-0799042df998ccfae"
      [33m~[0m[0m instance             = "i-001dfccad00403f48" -> (known after apply)
        tags                 = {}
        [90m# (12 unchanged attributes hidden)[0m[0m
    }

[1m  # aws_eip_association.hashicat[0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "aws_eip_association" "hashicat" {
      [33m~[0m[0m id                   = "eipassoc-09697441d3ca18792" -> (known after apply)
      [33m~[0m[0m instance_id          = "i-001dfccad00403f48" [31m# forces replacement[0m[0m -> (known after apply) [31m# forces replacement[0m[0m
      [33m~[0m[0m network_interface_id = "eni-01bd136c123b7988a" -> (known after apply)
      [33m~[0m[0m private_ip_address   = "10.0.10.167" -> (known after apply)
      [33m~[0m[0m public_ip            = "15.165.135.12" -> (known after apply)
        [90m# (1 unchanged attribute hidden)[0m[0m
    }

[1m  # aws_instance.hashicat[0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "aws_instance" "hashicat" {
      [33m~[0m[0m arn                                  = "arn:aws:ec2:ap-northeast-2:156401130715:instance/i-001dfccad00403f48" -> (known after apply)
      [33m~[0m[0m availability_zone                    = "ap-northeast-2a" -> (known after apply)
      [33m~[0m[0m cpu_core_count                       = 1 -> (known after apply)
      [33m~[0m[0m cpu_threads_per_core                 = 2 -> (known after apply)
      [33m~[0m[0m disable_api_stop                     = false -> (known after apply)
      [33m~[0m[0m disable_api_termination              = false -> (known after apply)
      [33m~[0m[0m ebs_optimized                        = false -> (known after apply)
      [31m-[0m[0m hibernation                          = false [90m-> null[0m[0m
      [32m+[0m[0m host_id                              = (known after apply)
      [32m+[0m[0m host_resource_group_arn              = (known after apply)
      [32m+[0m[0m iam_instance_profile                 = (known after apply)
      [33m~[0m[0m id                                   = "i-001dfccad00403f48" -> (known after apply)
      [33m~[0m[0m instance_initiated_shutdown_behavior = "stop" -> (known after apply)
      [33m~[0m[0m instance_state                       = "running" -> (known after apply)
      [33m~[0m[0m ipv6_address_count                   = 0 -> (known after apply)
      [33m~[0m[0m ipv6_addresses                       = [] -> (known after apply)
      [33m~[0m[0m key_name                             = "stae1102-ssh-key.pem" [33m->[0m[0m "DEV-ssh-key.pem" [31m# forces replacement[0m[0m
      [33m~[0m[0m monitoring                           = false -> (known after apply)
      [32m+[0m[0m outpost_arn                          = (known after apply)
      [32m+[0m[0m password_data                        = (known after apply)
      [32m+[0m[0m placement_group                      = (known after apply)
      [33m~[0m[0m placement_partition_number           = 0 -> (known after apply)
      [33m~[0m[0m primary_network_interface_id         = "eni-01bd136c123b7988a" -> (known after apply)
      [33m~[0m[0m private_dns                          = "ip-10-0-10-167.ap-northeast-2.compute.internal" -> (known after apply)
      [33m~[0m[0m private_ip                           = "10.0.10.167" -> (known after apply)
      [33m~[0m[0m public_dns                           = "ec2-15-165-135-12.ap-northeast-2.compute.amazonaws.com" -> (known after apply)
      [33m~[0m[0m public_ip                            = "15.165.135.12" -> (known after apply)
      [33m~[0m[0m secondary_private_ips                = [] -> (known after apply)
      [33m~[0m[0m security_groups                      = [] -> (known after apply)
      [33m~[0m[0m tags                                 = {
          [33m~[0m[0m "Name" = "stae1102-hashicat-instance" [33m->[0m[0m "DEV-hashicat-instance"
        }
      [33m~[0m[0m tags_all                             = {
          [33m~[0m[0m "Name"    = "stae1102-hashicat-instance" [33m->[0m[0m "DEV-hashicat-instance"
            [90m# (2 unchanged elements hidden)[0m[0m
        }
      [33m~[0m[0m tenancy                              = "default" -> (known after apply)
      [32m+[0m[0m user_data                            = (known after apply)
      [32m+[0m[0m user_data_base64                     = (known after apply)
      [33m~[0m[0m vpc_security_group_ids               = [
          [31m-[0m[0m "sg-0afc3a656042a8dff",
        ] -> (known after apply)
        [90m# (7 unchanged attributes hidden)[0m[0m

      [31m-[0m[0m capacity_reservation_specification {
          [31m-[0m[0m capacity_reservation_preference = "open" [90m-> null[0m[0m
        }

      [31m-[0m[0m cpu_options {
          [31m-[0m[0m core_count       = 1 [90m-> null[0m[0m
          [31m-[0m[0m threads_per_core = 2 [90m-> null[0m[0m
        }

      [31m-[0m[0m credit_specification {
          [31m-[0m[0m cpu_credits = "unlimited" [90m-> null[0m[0m
        }

      [31m-[0m[0m enclave_options {
          [31m-[0m[0m enabled = false [90m-> null[0m[0m
        }

      [31m-[0m[0m maintenance_options {
          [31m-[0m[0m auto_recovery = "default" [90m-> null[0m[0m
        }

      [31m-[0m[0m metadata_options {
          [31m-[0m[0m http_endpoint               = "enabled" [90m-> null[0m[0m
          [31m-[0m[0m http_put_response_hop_limit = 1 [90m-> null[0m[0m
          [31m-[0m[0m http_tokens                 = "optional" [90m-> null[0m[0m
          [31m-[0m[0m instance_metadata_tags      = "disabled" [90m-> null[0m[0m
        }

      [31m-[0m[0m private_dns_name_options {
          [31m-[0m[0m enable_resource_name_dns_a_record    = false [90m-> null[0m[0m
          [31m-[0m[0m enable_resource_name_dns_aaaa_record = false [90m-> null[0m[0m
          [31m-[0m[0m hostname_type                        = "ip-name" [90m-> null[0m[0m
        }

      [31m-[0m[0m root_block_device {
          [31m-[0m[0m delete_on_termination = true [90m-> null[0m[0m
          [31m-[0m[0m device_name           = "/dev/sda1" [90m-> null[0m[0m
          [31m-[0m[0m encrypted             = false [90m-> null[0m[0m
          [31m-[0m[0m iops                  = 100 [90m-> null[0m[0m
          [31m-[0m[0m tags                  = {} [90m-> null[0m[0m
          [31m-[0m[0m throughput            = 0 [90m-> null[0m[0m
          [31m-[0m[0m volume_id             = "vol-0c648e382c17f15c1" [90m-> null[0m[0m
          [31m-[0m[0m volume_size           = 8 [90m-> null[0m[0m
          [31m-[0m[0m volume_type           = "gp2" [90m-> null[0m[0m
        }
    }

[1m  # aws_internet_gateway.hashicat[0m will be updated in-place
[0m  [33m~[0m[0m resource "aws_internet_gateway" "hashicat" {
        id       = "igw-0696bd5b35b9b7839"
      [33m~[0m[0m tags     = {
          [33m~[0m[0m "Name" = "stae1102-internet-gateway" [33m->[0m[0m "DEV-internet-gateway"
        }
      [33m~[0m[0m tags_all = {
          [33m~[0m[0m "Name"    = "stae1102-internet-gateway" [33m->[0m[0m "DEV-internet-gateway"
            [90m# (2 unchanged elements hidden)[0m[0m
        }
        [90m# (3 unchanged attributes hidden)[0m[0m
    }

[1m  # aws_key_pair.hashicat[0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "aws_key_pair" "hashicat" {
      [33m~[0m[0m arn             = "arn:aws:ec2:ap-northeast-2:156401130715:key-pair/stae1102-ssh-key.pem" -> (known after apply)
      [33m~[0m[0m fingerprint     = "32:0f:bd:ab:46:61:9b:1d:df:73:33:b5:49:32:4c:4e" -> (known after apply)
      [33m~[0m[0m id              = "stae1102-ssh-key.pem" -> (known after apply)
      [33m~[0m[0m key_name        = "stae1102-ssh-key.pem" [33m->[0m[0m "DEV-ssh-key.pem" [31m# forces replacement[0m[0m
      [32m+[0m[0m key_name_prefix = (known after apply)
      [33m~[0m[0m key_pair_id     = "key-0f6e7df9535c17eb8" -> (known after apply)
      [33m~[0m[0m key_type        = "rsa" -> (known after apply)
      [31m-[0m[0m tags            = {} [90m-> null[0m[0m
        [90m# (2 unchanged attributes hidden)[0m[0m
    }

[1m  # aws_security_group.hashicat[0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "aws_security_group" "hashicat" {
      [33m~[0m[0m arn                    = "arn:aws:ec2:ap-northeast-2:156401130715:security-group/sg-0afc3a656042a8dff" -> (known after apply)
      [33m~[0m[0m id                     = "sg-0afc3a656042a8dff" -> (known after apply)
      [33m~[0m[0m name                   = "stae1102-security-group" [33m->[0m[0m "DEV-security-group" [31m# forces replacement[0m[0m
      [32m+[0m[0m name_prefix            = (known after apply)
      [33m~[0m[0m owner_id               = "156401130715" -> (known after apply)
      [33m~[0m[0m tags                   = {
          [33m~[0m[0m "Name" = "stae1102-security-group" [33m->[0m[0m "DEV-security-group"
        }
      [33m~[0m[0m tags_all               = {
          [33m~[0m[0m "Name"    = "stae1102-security-group" [33m->[0m[0m "DEV-security-group"
            [90m# (2 unchanged elements hidden)[0m[0m
        }
        [90m# (5 unchanged attributes hidden)[0m[0m
    }

[1m  # aws_subnet.hashicat[0m will be updated in-place
[0m  [33m~[0m[0m resource "aws_subnet" "hashicat" {
        id                                             = "subnet-0c9c479fc2ba47a98"
      [33m~[0m[0m tags                                           = {
          [33m~[0m[0m "name" = "stae1102-subnet" [33m->[0m[0m "DEV-subnet"
        }
      [33m~[0m[0m tags_all                                       = {
          [33m~[0m[0m "name"    = "stae1102-subnet" [33m->[0m[0m "DEV-subnet"
            [90m# (2 unchanged elements hidden)[0m[0m
        }
        [90m# (15 unchanged attributes hidden)[0m[0m
    }

[1m  # aws_vpc.hashicat[0m will be updated in-place
[0m  [33m~[0m[0m resource "aws_vpc" "hashicat" {
        id                                   = "vpc-08957f3a49972148c"
      [33m~[0m[0m tags                                 = {
            "environment" = "Production"
          [33m~[0m[0m "name"        = "stae1102-vpc-ap-northeast-2" [33m->[0m[0m "DEV-vpc-ap-northeast-2"
        }
      [33m~[0m[0m tags_all                             = {
          [33m~[0m[0m "name"        = "stae1102-vpc-ap-northeast-2" [33m->[0m[0m "DEV-vpc-ap-northeast-2"
            [90m# (3 unchanged elements hidden)[0m[0m
        }
        [90m# (16 unchanged attributes hidden)[0m[0m
    }

[1mPlan:[0m 4 to add, 4 to change, 4 to destroy.
[0m

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
**Pusher**: @stae1102
**Action**: pull_request
